Revit 2027 API
TableCellStyle.FontName Property
 The font used for this style
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string FontName { get; set; }
Public Property FontName As String
	Get
	Set
public:
property String^ FontName {
	String^ get ();
	void set (String^ value);
}
member FontName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
TableCellStyle Class
Autodesk.Revit.DB Namespace